Revit 2026 API

# DirectShapeTypeUserAssignability Enumeration

---

Options for a DirectShapeType which affect whether or not it can be assigned as the type of a DirectShape.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DirectShapeTypeUserAssignability
```
```vb
Public Enumeration DirectShapeTypeUserAssignability
```
```cpp
public enum class DirectShapeTypeUserAssignability
```
```fsharp
type DirectShapeTypeUserAssignability
```

| Member name | Value | Description |
| --- | --- | --- |
| Assignable | 0 | The DirectShapeType can be used to replace the type of an existing DirectShape. |
| Nonassignable | 1 | The DirectShapeType cannot be used to replace the type of an existing DirectShape. |

Only DirectShapeTypes which permit assignability will be shown in the type selector dialog. A DirectShape which uses a DirectShapeType which is not assignable can be copied.

#### Reference

Autodesk.Revit.DB Namespace